#### Terragrunt Plan 📖 - dev

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::bs-app-dev-bucket-308269940941" -> (known after apply)
      ~ bucket                      = "bs-app-dev-bucket-308269940941" -> "testapp11-308269940941" # forces replacement
      ~ bucket_domain_name          = "bs-app-dev-bucket-308269940941.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_region               = "us-east-2" -> (known after apply)
      ~ bucket_regional_domain_name = "bs-app-dev-bucket-308269940941.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "bs-app-dev-bucket-308269940941" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          + "Application" = "testapp11"
          + "CostCenter"  = "engineering"
          + "CreatedBy"   = "Toyota-Data-Engineering-Portal"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          ~ "Name"        = "bs-app-dev-bucket-308269940941" -> "testapp11-308269940941"
          ~ "Owner"       = "DevTeam" -> "nravikirankumar@gmail.com"
          - "Project"     = "MyApp" -> null
        }
      ~ tags_all                    = {
          + "Application" = "testapp11"
          + "CostCenter"  = "engineering"
          + "CreatedBy"   = "Toyota-Data-Engineering-Portal"
          ~ "Environment" = "default" -> "dev"
          ~ "ManagedBy"   = "Terragrunt" -> "Terraform"
          ~ "Name"        = "bs-app-dev-bucket-308269940941" -> "testapp11-308269940941"
          ~ "Owner"       = "DevTeam" -> "nravikirankumar@gmail.com"
          - "Project"     = "MyApp" -> null
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "41ac69a5836a5dd26ee0de06e2ec03dc6b3b79fb67704296e8244944ad6eec3c" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "cleanup-old-versions" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 90 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_lifecycle_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "this" {
      ~ bucket                                 = "bs-app-dev-bucket-308269940941" # forces replacement -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "bs-app-dev-bucket-308269940941" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ rule {
            id     = "cleanup-old-versions"
            # (1 unchanged attribute hidden)

          ~ expiration {
              ~ days                         = 90 -> 365
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "bs-app-dev-bucket-308269940941" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "bs-app-dev-bucket-308269940941" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      ~ bucket = "bs-app-dev-bucket-308269940941" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "bs-app-dev-bucket-308269940941" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - blocked_encryption_types = [] -> null
          - bucket_key_enabled       = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket = "bs-app-dev-bucket-308269940941" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "bs-app-dev-bucket-308269940941" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  ~ bucket_arn                  = "arn:aws:s3:::bs-app-dev-bucket-308269940941" -> (known after apply)
  ~ bucket_domain_name          = "bs-app-dev-bucket-308269940941.s3.amazonaws.com" -> (known after apply)
  ~ bucket_id                   = "bs-app-dev-bucket-308269940941" -> (known after apply)
  ~ bucket_regional_domain_name = "bs-app-dev-bucket-308269940941.s3.us-east-2.amazonaws.com" -> (known after apply)

```

</details>

*Pushed by: @ravikik, Action: `pull_request`*